/**
 * ****************************************************************************
 * @file     mem_alloc.c
 * @brief    
 * @author   wu di (wudi2504@163.com)
 * @version  1.0
 * @date     2021-04-24
 * 
 * @copyright Copyright (c) 2021
 * ****************************************************************************
 */

#include <malloc.h>

#include "mem_alloc.h"
/**
 * ****************************************************************************
 * @brief    针对不同平台的malloc函数进行封装或实现
 * 
 * @param    byte_num  申请的字节数
 * @return   void* 
 * ****************************************************************************
 */
void *mem_alloc(int byte_num)
{
    return malloc(byte_num);
}
/**
 * ****************************************************************************
 * @brief    针对不同平台的free函数进行封装或实现
 *           同时将释放的指针赋值空
 * 
 * @param    ptr       要释放的指针
 * ****************************************************************************
 */
void mem_free(void *ptr)
{
    free(ptr);
    ptr = NULL;
}
